tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "mongodb/brew"
tap "sass/sass"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Modern replacement for 'ls'
brew "exa"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Database migrations CLI tool
brew "golang-migrate"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Language for application scale JavaScript development
brew "typescript", link: false
# Watch files and take action when they change
brew "watchman"
# JavaScript package manager
brew "yarn"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# Stylesheet Preprocessor
brew "sass/sass/sass", link: false
# Application launcher and productivity software
cask "alfred"
# Web browser focusing on privacy
cask "brave-browser"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Git client focusing on productivity
cask "gitkraken"
# Open-source code editor
cask "visual-studio-code"
